const bhajans = [
    {
        id: "ಗಜಮುಖನೆ ಗಣಪತಿಯೇ",
        category: "ಗಣಪತಿ ಭಜನೆ",
        title: "ಗಜಮುಖನೆ ಗಣಪತಿಯೇ",
        lyrics: 'ಶುಕ್ಲಾಂಬರಧರಂ ವಿಷ್ಣುಂ

ಶಶಿವರ್ಣಂ ಚತುರ್ಭುಜಂ
ಪ್ರಸನ್ನ ವದನಂ ಧ್ಯಾಯೇತ್
ಸರ್ವ ವಿಘ್ನೋಪ ಶಾಂತಯೇತ್
ಆ..ಆ..ಆ..ಆಆಆಆ

ಗಜಮುಖನೆ ಗಣಪತಿಯೇ ನಿನಗೆ ವಂದನೆ
ನಂಬಿದವರ ಪಾಲಿನ ಕಲ್ಪತರು ನೀನೆ..
ಗಜಮುಖನೆ ಗಣಪತಿಯೇ ನಿನಗೆ ವಂದನೆ
ನಂಬಿದವರ ಪಾಲಿನ ಕಲ್ಪತರು ನೀನೆ..

ಭಾದ್ರಪದ ಶುಕ್ಲದ ಚೌತಿಯಂದು
ನೀ ಮನೆಮನೆಗೂ ದಯಮಾಡಿ ಹರಸು ಎಂದೂ...
ಭಾದ್ರಪದ ಶುಕ್ಲದ ಚೌತಿಯಂದು
ನೀ ಮನೆಮನೆಗೂ ದಯಮಾಡಿ ಹರಸು ಎಂದೂ...

ನಿನ್ನ ಸನ್ನಿಧಾನದಿ ತಲೆಬಾಗಿ ಕೈಯ ಮುಗಿದು
ಬೇಡುವಾ ಭಕ್ತರಿಗೆ ನೀ ದಯಾಸಿಂಧು …


ಗಜಮುಖನೆ ಗಣಪತಿಯೇ ನಿನಗೆ ವಂದನೆ

ನಂಬಿದವರ ಪಾಲಿನ ಕಲ್ಪತರು ನೀನೆ

ಈರೇಳು ಲೋಕದ ಅಣುಅಣುವಿನಾ..

ಇಹಪರದಾ ಸಾಧನಕೆ ನೀ ಕಾರಣ..
ಈರೇಳು ಲೋಕದ ಅಣು ಅಣುವಿನಾ..
ಇಹಪರದಾ ಸಾಧನಕೆ ನೀ ಕಾರಣ..

ನಿನ್ನೊಲುಮೆ ನೋಟದ ಒಂದು ಹೊನ್ನಕಿರಣ
ನೀಡಿದರೆ ಸಾಕಯ್ಯಾ ಜನ್ಮ ಪಾವನ


ಗಜಮುಖನೆ ಗಣಪತಿಯೇ ನಿನಗೆ ವಂದನೆ
ನಂಬಿದವರ ಪಾಲಿನ ಕಲ್ಪತರು ನೀನೆ..

ಪಾರ್ವತೀ ಪರಶಿವನಾ ಪ್ರೇಮ ಪುತ್ರನೇ
ಪಾಲಿಸುವ ಪರದೈವ ಬೇರೆ ಕಾಣೆ
ಪಾರ್ವತೀ ಪರಶಿವನಾ ಪ್ರೇಮ ಪುತ್ರನೇ
ಪಾಲಿಸುವ ಪರದೈವ ಬೇರೆ ಕಾಣೆ

ಪಾಪದ ಪಂಕದಲಿ ಪದುಮನೆನಿಸು ಎನ್ನ

ಪಾದಸೇವೆ ಒಂದೇ ಧರ್ಮಸಾಧನ

ಗಜಮುಖನೆ ಗಣಪತಿಯೇ ನಿನಗೆ ವಂದನೆ
ನಂಬಿದವರ ಪಾಲಿನ ಕಲ್ಪತರು ನೀನೆ...'
        youtube_url: "https://youtu.be/B49zBq2-nx4?si=MX8QSRpTANXrdGww"
    },

    {
        id: "a2",
        category: "Bhajan A",
        title: "A2",
        lyrics: `This is the lyrics of A2.

Line 1
Line 2
Line 3`,
        youtube_url: "https://www.youtube.com/watch?v=YYYYYYYYYYY"
    },

    {
        id: "b1",
        category: "Bhajan B",
        title: "B1",
        lyrics: `This is the lyrics of B1.

Line 1
Line 2
Line 3`,
        youtube_url: ""
    },

    {
        id: "b2",
        category: "Bhajan B",
        title: "B2",
        lyrics: `This is the lyrics of B2.

Line 1
Line 2
Line 3`,
        youtube_url: "https://www.youtube.com/watch?v=ZZZZZZZZZZZ"
    }
];
