const bhajans = [
    {
        id: "ಗಜಮುಖನೆ ಗಣಪತಿಯೇ",
        category: "ಗಣಪತಿ ಭಜನೆ",
        title: "ಗಜಮುಖನೆ ಗಣಪತಿಯೇ",
        lyrics: `ಶುಕ್ಲಾಂಬರಧರಂ ವಿಷ್ಣುಂ.

ಶಶಿವರ್ಣಂ ಚತುರ್ಭುಜಂ
ಪ್ರಸನ್ನ ವದನಂ ಧ್ಯಾಯೇತ್
ಸರ್ವ ವಿಘ್ನೋಪ ಶಾಂತಯೇತ್
ಆ..ಆ..ಆ..ಆಆಆಆ

ಗಜಮುಖನೆ ಗಣಪತಿಯೇ ನಿನಗೆ ವಂದನೆ
ನಂಬಿದವರ ಪಾಲಿನ ಕಲ್ಪತರು ನೀನೆ..
ಗಜಮುಖನೆ ಗಣಪತಿಯೇ ನಿನಗೆ ವಂದನೆ
ನಂಬಿದವರ ಪಾಲಿನ ಕಲ್ಪತರು ನೀನೆ..

ಭಾದ್ರಪದ ಶುಕ್ಲದ ಚೌತಿಯಂದು
ನೀ ಮನೆಮನೆಗೂ ದಯಮಾಡಿ ಹರಸು ಎಂದೂ...
ನಿನ್ನ ಸನ್ನಿಧಾನದಿ ತಲೆಬಾಗಿ ಕೈಯ ಮುಗಿದು
ಬೇಡುವಾ ಭಕ್ತರಿಗೆ ನೀ ದಯಾಸಿಂಧು …

ಗಜಮುಖನೆ ಗಣಪತಿಯೇ ನಿನಗೆ ವಂದನೆ
ನಂಬಿದವರ ಪಾಲಿನ ಕಲ್ಪತರು ನೀನೆ

ಈರೇಳು ಲೋಕದ ಅಣುಅಣುವಿನಾ..
ಇಹಪರದಾ ಸಾಧನಕೆ ನೀ ಕಾರಣ..
ನಿನ್ನೊಲುಮೆ ನೋಟದ ಒಂದು ಹೊನ್ನಕಿರಣ
ನೀಡಿದರೆ ಸಾಕಯ್ಯಾ ಜನ್ಮ ಪಾವನ

ಗಜಮುಖನೆ ಗಣಪತಿಯೇ ನಿನಗೆ ವಂದನೆ
ನಂಬಿದವರ ಪಾಲಿನ ಕಲ್ಪತರು ನೀನೆ..

ಪಾರ್ವತೀ ಪರಶಿವನಾ ಪ್ರೇಮ ಪುತ್ರನೇ
ಪಾಲಿಸುವ ಪರದೈವ ಬೇರೆ ಕಾಣೆ
ಪಾಪದ ಪಂಕದಲಿ ಪದುಮನೆನಿಸು ಎನ್ನ
ಪಾದಸೇವೆ ಒಂದೇ ಧರ್ಮಸಾಧನ

ಗಜಮುಖನೆ ಗಣಪತಿಯೇ ನಿನಗೆ ವಂದನೆ
ನಂಬಿದವರ ಪಾಲಿನ ಕಲ್ಪತರು ನೀನೆ...`,
        youtube_url: "https://youtu.be/B49zBq2-nx4?si=MX8QSRpTANXrdGww"
    },

    {
        id: "ಗಜವದನ ಬೇಡುವೆ",
        category: "ಗಣಪತಿ ಭಜನೆ",
        title: "ಗಜವದನ ಬೇಡುವೆ",
        lyrics: `ಗಜವದನ ಬೇಡುವೆ ಗೌರಿ ತನಯ
ತ್ರಿಜಗ ವಂದಿತನೇ ಸುಜನರ ಪೊರೆವನೇ

ಪಾಶಾಂಕುಶಧರ ಪರಮ ಪವಿತ್ರ
ಮೂಷಿಕವಾಹನ ಮುನಿಜನಪ್ರೇಮಾ

ಮೋದದಿ ನಿನ್ನಯ ಪಾದವ ತೋರೋ
ಸಾಧು ವಂದಿತನೆ ಆದರದಿಂದಲಿ

ಸರಸಿಜನಾಭ ಶ್ರಿ ಪುರಂದರ ವಿಠಲನ
ನಿರುತ ನೆನೆಯುವಂತೆ ದಯ ಮಾಡೋ`,
        youtube_url: "https://youtu.be/UD2wAYSkOdQ?si=TR-INCq7hHdoYcX-"
    },
    
    {
        id: "ಶರಣು ಸಿದ್ಧಿ ವಿನಾಯಕ",
        category: "ಗಣಪತಿ ಭಜನೆ",
        title: "ಶರಣು ಸಿದ್ಧಿ ವಿನಾಯಕ",
        lyrics: `ಶರಣು ಸಿದ್ಧಿ ವಿನಾಯಕ ಶರಣು ವಿದ್ಯಾಪ್ರದಾಯಕ || ಪ ||

ಶರಣು ಪಾರ್ವತಿ ತನಯ ಮೂರುತಿ
ಶರಣು ಮೂಷಿಕ ವಾಹನ || ಅ.ಪ. ||

ನಿಟಿಲ ನೇತ್ರನ ದೇವಿಸುತನೆ
ನಾಗಭೂಷಣ ಪ್ರೀಯನೇ
ಕಟಿತಟಾಂಕಿತ ಕೋಮಲಾಂಗನೆ
ಕರ್ಣಕುಂಡಲ ಧಾರನೆ || 1 ||

ಬಟ್ಟ ಮುತ್ತಿನ ಹಾರಪದಕನೆ
ಬಾಹು ಹಸ್ತ ಚತುಷ್ಕನೇ
ಇಟ್ಟ ತೊಡುಗೆಯ ಹೇಮ ಕಂಕಣ
ಪಾಶ ಅಂಕುಶ ಧಾರನೆ || ೨ ||

ಕುಕ್ಷಿ ಮಹಾಲಂಬೋದರನೆ
ಇಕ್ಷು ಚಾಪನ ಗೆಲಿದನೇ
ಪಕ್ಷಿವಾಹನ ಶ್ರೀಪುರಂದರ
ವಿಠಲನ ನಿಜ ದಾಸನೆ || ೩ ||`,
        youtube_url: "https://youtu.be/PQIOu-FeS-A?si=OnZSfRHzsnzeo3I-"
    },
    {
        id: "ನಂದಿನಿ ಕಟಿಯಲ್ಲಿ ಕುಳಿತಿಹ ಚೆಲುವೆ",
        category: "ದೇವಿ ಭಜನೆ",
        title: "ನಂದಿನಿ ಕಟಿಯಲ್ಲಿ ಕುಳಿತಿಹ ಚೆಲುವೆ ",
        lyrics: `ನಂದಿನಿ ಕಟಿಯಲ್ಲಿ ಕುಳಿತಿಹ ಚೆಲುವೆ 
ಮುಡಿಯೆ ಹೂಮಾಳೆ 
ತಾಯೆ ಮುಡಿಯೆ ಹೂಮಾಳೆ
                                  ||ನಂದಿನಿ||

ಸುಂದರಿ ಭ್ರಾಮರಿ ನಯನ ಮನೋಹರಿ||2||
ಚಂದಿರ ಮುಡಿಯ ಭ್ರಂಗ ಕುಂತಳೆ||2||
ಮಳ್ಳಿಗೆ  ಸಂಪಿಗೆ  ಜಾಜಿ  ಸೇವಂತಿಗೆ 
ಪಾದರಿ ತಾವರೆ ಸುರಗೆ ಕೇದಗೆ||ಮಳ್ಳಿಗೆ||
ಮುಡಿಯೆ ಹೂಮಾಳೆ 
ತಾಯೆ ಮುಡಿಯೆ ಹೂಮಾಳೆ
                                ||ನಂದಿನಿ||

ಶಂಕ ಚಕ್ರಧರೆ ಪಂಕಜಲೋಚನೆ||2||
ಅಂದುಗೆ ಝಣರವ ಸುನಾದ ವಂದಿನಿ||2||
ಮರುಗ ಮಳ್ಳಿಗೆ  ಜಾಜಿ  ಸೇವಂತಿಗೆ
ಸುರಗಿ ಪಾದರಿ ತಾವರೆ ಸಂಪಿಗೆ
                              ||ಮರುಗ||
ಮುಡಿಯೆ ಹೂಮಾಳೆ 
ತಾಯೆ ಮುಡಿಯೆ ಹೂಮಾಳೆ
                               ||ನಂದಿನಿ||

ಪಟ್ಟೆ ಪೀತಾಂಬರಿ ಉಟ್ಟ ಸುಕುಮಾರಿ||2||
ದಿಟ್ಟ ಕಂಗಳ ಬೆಳಕ ಲಾವಣ್ಯ ಮಂಜರಿ||2||
ಜಾಜಿ ಜವನ ಮಳ್ಳಿಗೆ ಸಂಪಿಗೆ
ತಾಳೆ ಪಾದರಿ ಮಾಗಳಿ ನೈದಿಲೆ || ಜಾಜಿ ||
ಮುಡಿಯೆ ಹೂಮಾಳೆ 
ತಾಯೆ ಮುಡಿಯೆ ಹೂಮಾಳೆ
                              ||ನಂದಿನಿ||`,
        youtube_url: "https://youtu.be/4OMcBE72TAU?si=bsC1J8Q8HJvliLDJ"
    },
    {
        id: "ನೀಲ ನೀಲ ನೀಲ ಮಲೈಯಿಲ್",
        category: "ಅಯ್ಯಪ್ಪ ಭಜನೆ",
        title: "ನೀಲ ನೀಲ ನೀಲ ಮಲೈಯಿಲ್",
        lyrics: `ನೀಲ ನೀಲ ನೀಲ ಮಲೈಯಿಲ್ ಸ್ವಾಮಿಯೇ ... ಮಂಜರಿನ್ಯೂ ಅ ಮಲೈಯಿಲ್ ಅಯ್ಯಪ್ಪೋ... 
ಪೊನ್ನ ನಿನ್ನ ಕೋವಿಲುಲ್ಲಿಲ್ ಅಯ್ಯಪ್ಪೋ 
ನೆಯ್ಯನಿನ್ನ ನಿನ್ ರೂಪಂ ||నిeల నిeల||

ಸ್ವಾಮಿ ಶರಣಂ ಶರಣಂ ಶರಣಂ ಸ್ವಾಮಿಯೇ.. 
ಹರಿಹರ ಸುತನ್ ಅಖಿಲವರದನ್ ಅಯ್ಯಪ್ಪ  ||ಸ್ವಾಮಿ||

1.ಹರಿಹರ ಸುತನ್ ಅಯ್ಯನ್ 
ಅರಿವಿನ್ ಪೊರುಲಯ್ಯನ್ ||ಹರಿ||

ಏಕಾಂತವಾಸನಾಗುಂ ಸ್ವಾಮಿಯೇ..
ವರವೇಡಿ ತೆಳಿಯನೇ ಅಯ್ಯಪ್ಪಾ || ನೀಲ ||

ಸ್ವಾಮಿ ಶರಣಂ ಶರಣಂ ಶರಣಂ ಸ್ವಾಮಿಯೇ..
 ಹರಿಹರ ಸುತನ್ ಅಖಿಲವರದನ್ ಅಯ್ಯಪ್ಪ ||ಸ್ವಾಮಿ||

2.ಕಲಿಯುಗ ವರದನ್ ಅಯ್ಯನ್ 
ಕಾನನವಾಸನ್‌ ಅಯ್ಯನ್ ||ಕಲಿಯುಗ|| 
ಕರ್ಪೂರ ಪ್ರಿಯನಾಗುಂ ಸ್ವಾಮಿಯೇ... 
ಪಾಪಂಗಳ ತೀರ್ಕನೇ ಅಯ್ಯಪ್ಪಾ || ನೀಲ ||

ಸ್ವಾಮಿ ಶರಣಂ ಶರಣಂ ಶರಣಂ ಸ್ವಾಮಿಯೇ..
ಹರಿಹರ ಸುತನ್ ಅಖಿಲವರದನ್ ಅಯ್ಯಪ್ಪ ||ಸ್ವಾಮಿ||`,
        youtube_url: "https://youtu.be/oRZb2UtCW2k?si=SWjSPdkW3SqTZaii"
    },

    {
        id: "ಹರಿರೇ ರಂಗಮ್ಮಾಜಿ",
        category: "ಕೃಷ್ಣನ ಭಜನೆ",
        title: "ಹರಿರೇ ರಂಗಮ್ಮಾಜಿ",
        lyrics: `ಹರಿರೇ ರಂಗಮ್ಮಾಜಿ.. ಹರಿರೇ ಕೃಷ್ಣಮ್ಮಾಜಿ.

ರಂಗಮ್ಮಾ ಮಾಜ್ಹಿ ರಂಗಮ್ಮಾ

ರಂಗಮ್ಮಾ ಮಾಜ್ಹಿ ರಂಗಮ್ಮಾ
ಹರಿ ರೇ ರಂಗಮ್ಮಾಜಿ ಹರಿ ರೇ ಕೃಷ್ಣಮ್ಮಾಜಿ (ರಂಗಮ್ಮಾ ಮಾಜ್ಹಿ ರಂಗಮ್ಮಾ)

ಮುಖ್ತಾಬಲ ನೃತನಾಗಿ ಪೀತಾಂಬರ ಅಂಗಜಾಂಗಿ
ಚರಣೀ ವಾಳಿ ವ್ಯಾಲೇ ವಾಂಘಿ ರಂಗಮ್ಮಾ
ರಂಗಮ್ಮಾ ಮಾಜ್ಹಿ ರಂಗಮ್ಮಾ

ವಿಟೇವರಿ ನೀಡೆ ಉಭಿ ಸಾಜೇ ಚಂದ್ರಭಾಗೇ ತೀರಿ
ನಾಮಯಾಚೀ ಕೈವಾರೀ ರಂಗಮ್ಮಾ
ರಂಗಮ್ಮಾ ಮಾಜ್ಹಿ ರಂಗಮ್ಮಾ


ವಿಟ್ಟಲ ಪಾಂಡುರಂಗ ವಿಟ್ಟಲ ಪಾಂಡುರಂಗಾ
ವಿಟ್ಟಲಾಾ ಪಾಂಡುರಂಗಾ`,
        youtube_url: "https://youtu.be/JtpdAqc-DEc?si=L4fORrXq9Bk3a4n_"
    },

    {
        id: "ಇದುವೇ ಪಂಡರಾಪುರ ವಿಠಲ",
        category: "ಕೃಷ್ಣನ ಭಜನೆ",
        title: "ಇದುವೇ ಪಂಡರಾಪುರ ವಿಠಲ",
        lyrics: `ಇದುವೇ ಪಂಡರಾಪುರ ವಿಠಲ 
        ಇದ ನಾ ಅರಿಯದೆ ಪೋದೆ ಮುಕ್ತಿಯ ಧಾಮ||ಪ|| 
        
        ಪಾಪ ತೊಳೆವ ಪಾವನ ಚಂದ್ರಭಾಗ  
        ತಾಪವ ಹರಿಸಿ ಶಾಂತಿಯನೀವ  
        ಈ ವರ ಕ್ಷೇತ್ರ ಭೂವೈಕುಂಠ 
        ಭವ ಭಯ ಪರಿಹಾರ ವಿಠಲ ||೧|| 
        
        ಪುಣ್ಯದ ದಿವಸವು ಏಕಾದಶಿ ಯಂದು 
        ಹಾಡುತ ನಲಿಯುತ ಭಕುತರು ಬಂದು 
        ನೋಡುವ ಭಾಗ್ಯ ಎನಗೆ ಇಂದು  
        ಕರುಣಿಸಿ ಮುದಗೈದೆ ವಿಠಲ || ೨|| 
        
        ಶಾಂತಲ ಜಾಣೆಯು ಚೋಕಮೇಲನು  
        ಶ್ರೀ ತುಕಾರಾಮನು ಜ್ಞಾನೇಶ್ವರನು 
        ಪುಂಡಲೀಕನು ನಾಮದೇವನು  
        ಮೋಕ್ಷವನೇ ಪಡೆದ ವಿಠಲ ||೩||`,
        youtube_url: "https://youtu.be/Kt98-MSgH-s?si=XX7SkoSklMZh0TQU"
    },

    {
        id: "ಪಂಢರಾಪುರವೆಂಬ ದೊಡ್ಡ ನಗರ",
        category: "ಕೃಷ್ಣನ ಭಜನೆ",
        title: "ಪಂಢರಾಪುರವೆಂಬ ದೊಡ್ಡ ನಗರ",
        lyrics: `ಪಂಢರಾಪುರವೆಂಬ ದೊಡ್ಡ ನಗರ 
        ಅಲ್ಲಿ ವಿಠೋಬನೆಂಬ ಸಾಹುಕಾರ 
        ವಿಠೋಬನಿರುವದು ನದಿತೀರ 
        ಅಲ್ಲಿ ಪಂಢರಿಭಜನೆ ವ್ಯಾಪಾರ ||ಪ|| 
        
        ತಂದೆ ನೀನೆ ತಾಯಿ ನೀನೆ ಪಾಂಡುರಂಗ 
        ನಮ್ಮ ಬಂಧು ನೀನೆ ಬಳಗ ನೀನೆ ಪಾಂಡುರಂಗ 
        ಭಕ್ತರ ಪೋಷಕ ಪಾಂಡುರಂಗ 
        ನಮ್ಮ ಮುಕ್ತಿದಾಯಕ ಪಾಂಡುರಂಗ ||೧|| 
        
        ವಿಠೋಬನಿಗೆ ಪ್ರಿಯ ತುಳಸಿಹಾರ 
        ಅಲ್ಲಿ ಭಕ್ತ ಜನರ ವ್ಯಾಪಾರ 
        ವಿಠೋಬನಿಗೆ ಪ್ರಿಯ ಬುಕ್ಕಿಯ ಗಂಧ 
        ಅಲ್ಲಿ ಚಂದ್ರಭಾಗಾ ಸ್ನಾನ ಬಲು ಅಂದ ||೨|| 
        
        ಶ್ರೀಹರಿ ವಿಠ್ಠಲ ಪಾಂಡುರಂಗ ಜಯ ಹರಿ ವಿಠ್ಠಲ ಪಾಂಡುರಂಗ 
        ವಿಠ್ಠಲ ವಿಠ್ಠಲ ಪಾಂಡುರಂಗ ನಮ್ಮ ಪುರಂದರ ವಿಠ್ಠಲ ಪಾಂಡುರಂಗ ||೩||`,
        youtube_url: "https://youtu.be/B__BtsqG9qQ?si=rN-BAyktwDHcLUnF"
    },

    {
        id: "ನಿನ್ನ ನಂಬಿದೆ ಜಗನ್ಮೋಹನಾ",
        category: "ಕೃಷ್ಣನ ಭಜನೆ",
        title: "ನಿನ್ನ ನಂಬಿದೆ ಜಗನ್ಮೋಹನಾ",
        lyrics: ``,
        youtube_url: "https://youtu.be/lZafsqTKjaE?si=-pqynykmfMMru7W3"
    },

    {
        id: "a2",
        category: "Bhajan A",
        title: "A2",
        lyrics: `This is the lyrics of A2.

Line 1
Line 2
Line 3`,
        youtube_url: "https://www.youtube.com/watch?v=YYYYYYYYYYY"
    },
    
    {
        id: "b1",
        category: "Bhajan B",
        title: "B1",
        lyrics: `This is the lyrics of B1.

Line 1
Line 2
Line 3`,
        youtube_url: ""
    },

    {
        id: "b2",
        category: "Bhajan B",
        title: "B2",
        lyrics: `This is the lyrics of B2.

Line 1
Line 2
Line 3`,
        youtube_url: "https://www.youtube.com/watch?v=ZZZZZZZZZZZ"
    }
];
